tutorials/validations4NFFoam/naturalConvectionHeterogeneous_Yekani/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "liblduSolvers.so"
    "libNF4Foam.so"
)

application     unsteadyStateNaturalConvection4NFFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          0.1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

InfoSwitches
{
    writePrecision  6;
    writeJobInfo    0;
    allowSystemOperations 1;
}

functions
{
    postProcess
    {
        functionObjectLibs	("libutilityFunctionObjects.so");
        type			coded;
        enabled			true;
        outputControl		outputTime;//timeStep;
        redirectType		postProcess;

        code
        #{
            std::ofstream output;
            output.open("postProcess.txt",std::ofstream::app);

            //- constants
            scalar rhobf = 993.0;
            scalar mubf = 696.0e-6;
            scalar kappabf = 0.628;
            scalar Cpbf = 4178.0;
            scalar betabf = 36.2e-5;
            scalar nubf = mubf/rhobf;
            scalar alphabf = kappabf/(rhobf*Cpbf);
            scalar deltaTemp = 2.0;
            scalar charL = 0.025;
            scalar g = 9.37;

            scalar Prbf = nubf/alphabf;
            scalar Grbf = (g*betabf*deltaTemp*pow(charL,3)) / (pow(nubf,2));
            scalar Rabf = (g*betabf*deltaTemp*pow(charL,3)) / (nubf*alphabf);


            //- lookup fields
            const volScalarField& T = mesh().lookupObject<volScalarField>("T");
            const volScalarField& kappaEff = mesh().lookupObject<volScalarField>("kappaEff");
            surfaceScalarField gradT = fvc::snGrad(T);

            //- find id and compute Nusselt number
            label rightID = T.mesh().boundaryMesh().findPatchID("right");
            scalar rightArea = sum(T.mesh().magSf().boundaryField()[rightID]);
            scalar rightHeatFluxAvg = sum(kappaEff.boundaryField()[rightID]*gradT.boundaryField()[rightID]*T.mesh().magSf().boundaryField()[rightID])/rightArea;
            scalar righthAvg = rightHeatFluxAvg/deltaTemp;
            scalar NusseltAvg = (righthAvg*charL)/(kappabf);


            //- save data
            output << "Rabf: " << Rabf << "\n";
            output << "Nu: " << NusseltAvg << "\n";
            output.close();
        #};
    }

}

// ************************************************************************* //
